nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmrw612/driver_examples/spi/eeprom/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: RW612
package_id: RW612ETA2I
mcu_data: ksdk2_0
processor_version: 16.3.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_io_mux.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: A14, peripheral: FLEXCOMM14, signal: SPI_MISO, pin_signal: GPIO_56}
  - {pin_num: M10, peripheral: FLEXCOMM14, signal: SPI_SCK, pin_signal: GPIO_54}
  - {pin_num: B13, peripheral: FLEXCOMM14, signal: SPI_MOSI, pin_signal: GPIO_57}
  - {pin_num: L11, peripheral: FLEXCOMM14, signal: SPI_SSELN0, pin_signal: GPIO_53}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : 
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{
    /* Initialize FC14_SPI_SS0 functionality on pin GPIO_56, GPIO_54, GPIO_57, GPIO_53 (pin A14_M10_B13_L11) */
    IO_MUX_SetPinMux(IO_MUX_FC14_SPI_SS0);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
